       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 NUM PIC 9999.
       77 N2 PIC 9999.
       77 N3 PIC 9999 VALUE 1.
       77 N4 PIC 9999.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "ESCREVA O NUMERO DA TABUADA QUE DESEJA" ACCEPT NUM
            DISPLAY "ATÉ QUE NUMERO DESEJA SABER A TABUADA?" ACCEPT N2
            PERFORM N2 TIMES
            COMPUTE N4=NUM*N3
            DISPLAY NUM " X " N3 " = " N4
            COMPUTE N3=N3+ 1
            END-PERFORM.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
