       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 Q2 PIC 999999.
       77 I PIC 999 VALUE 15.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM UNTIL I>200
           COMPUTE Q2=I*I
           COMPUTE I=I+ 1
           DISPLAY Q2
           END-PERFORM.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
