       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 NUM PIC 999.
       77 NUM2 PIC 999.
       77 NUM5 PIC 999.
       77 NUM10 PIC 999.
       77 R2 PIC 999.
       77 R5 PIC 999.
       77 R10 PIC 999.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "INSIRA UM NUMERO " ACCEPT NUM
            DIVIDE NUM BY 10 GIVING NUM10 REMAINDER R10
            DIVIDE NUM BY 5 GIVING NUM5 REMAINDER R5
            DIVIDE NUM BY 2 GIVING NUM2 REMAINDER R2

            IF R10=0 AND R5=0 AND R2=0
                DISPLAY "O " NUM " É DIVISIVEL POR 2,5 E 10"
            ELSE
                DISPLAY "NAO  É DIVISIVEL POR 2,5 E 10 "

            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
