       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 NUM PIC 9999.
       77 MEDIA PIC 9999V99.
       77 SOMA PIC 9999V99.
       77 SOMA1 PIC 9999V99.
       77 A PIC 9999.
       77 R PIC 9999.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM WITH TEST AFTER UNTIL NUM = 0
             DISPLAY "INSIRA UM NUMERO " ACCEPT NUM
             DIVIDE NUM BY 3 GIVING A REMAINDER R
             IF R=0 AND NUM NOT= 0
               COMPUTE SOMA1=NUM+SOMA1
               COMPUTE SOMA=SOMA+ 1
             END-IF
           END-PERFORM.
            COMPUTE MEDIA=SOMA1/SOMA
            DISPLAY "A MEDIA DOS NUMERO INSERIDOS É " MEDIA
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
