       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 VALOR PIC 999V99.
       77 VENDA PIC 999V99.
       77 LUCRO PIC 999V99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INSIRA O VALOR DO PRODUTO " ACCEPT VALOR
            IF VALOR <= 20
                COMPUTE LUCRO=VALOR * 0.30
                COMPUTE VENDA=LUCRO + VALOR
            ELSE
                COMPUTE LUCRO=VALOR * 0.15
                COMPUTE VENDA=LUCRO + VALOR
            END-IF.
                DISPLAY "IRA VENDER O PRODUTO A "VENDA "$"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
