       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX3.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 N1 PIC S99V99.
       77 N2 PIC S99V99.
       77 RES PIC S99V99.
       77 OP1 PIC 9.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "ESCOLHA UMA OPÇAO"
            DISPLAY "(1) PARA ADICIONAR, (2) PARA SUBTRAIR"
            DISPLAY "(3) PARA MULTIPLICAR, (4) PARA DUVIDIR"
            ACCEPT OP1
            DISPLAY "NUMERO 1 : " ACCEPT N1
            DISPLAY "NUMERO 2 : " ACCEPT N2
            EVALUATE OP1
            WHEN 1 ADD N1 TO N2 GIVING RES
            WHEN 2 SUBTRACT N1 FROM N2 GIVING RES
            WHEN 3 MULTIPLY N1 BY N2 GIVING RES
            WHEN 4 DIVIDE N1 BY N2 GIVING RES
            WHEN OTHER DISPLAY "INSIRA UMA OPÇAO VALIDA"
            END-EVALUATE.
            DISPLAY "O RESULTADO É " RES
            STOP RUN.
       END PROGRAM EX3.
