       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 FICHAS PIC 999V99.
       77 NFICHAS PIC 999V99.
       77 MEDIA PIC 999V99.
       77 NTESTE PIC 999V99.
       77 TESTE PIC 999V99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "INSIRA A NOTA DAS FICHAS" ACCEPT FICHAS
           COMPUTE NFICHAS=FICHAS* 0.65
           DISPLAY "QUAL FOI A NOTA DO TESTE?" ACCEPT TESTE
           COMPUTE NTESTE=TESTE* 0.35
           COMPUTE MEDIA=(NTESTE+NFICHAS)
           DISPLAY "A MEDIA É " MEDIA
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
