       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 ALTURA PIC 999.
       77 BASE PIC 999.
       77 A1 PIC 999.
       77 A2 PIC 999.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INSIRA A BASE " ACCEPT BASE
            DISPLAY "INSIRA A ALTURA " ACCEPT ALTURA
            MULTIPLY BASE BY ALTURA GIVING A1
            DIVIDE A1 BY 2 GIVING A2
            DISPLAY "A AREA É " A2
            STOP RUN.
            END PROGRAM YOUR-PROGRAM-NAME.
