       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 OP PIC 9.
       77 RES PIC 9999V99.
       77 NUM PIC 9999V99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "DESEJA CONVERTER PARA MILHA(0) OU KILOMETRO(1)?"
            ACCEPT OP
            DISPLAY "INSIRA O NUMERO : " ACCEPT NUM

            EVALUATE OP
            WHEN 0 COMPUTE RES=NUM* 1.6 DISPLAY RES " MILHAS"
            WHEN 1 COMPUTE RES=NUM/ 1.6 DISPLAY RES " KILOMETROS"
            WHEN OTHER DISPLAY "INSIRA UMA OPÇAO VÁLIDA"
            END-EVALUATE.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
