       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
        77 DIA PIC 99.
        77 MES PIC 99.
        77 ANO PIC 9999.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
      *     TENTEI USAR UMA ESTRUTURA POREM ESTAVA SEMPRE A DAR ERRO
      *     ESTAVA A LER OS NUMEROS E OS ESPAÇOS EX : 12 10 2000
      *     O DISPLAY ERA : 12 10 200
            DISPLAY "INSIRA UM DIA" ACCEPT DIA
            DISPLAY "INSIRA UM MES" ACCEPT MES
            DISPLAY "INSIRA UM ANO" ACCEPT ANO
            IF ANO<1900 OR ANO>2100
                DISPLAY "ANO INVALIDO"
            END-IF.
            EVALUATE MES
            WHEN 1 IF DIA<1 OR DIA>31 DISPLAY "DIA INVALIDO"
            WHEN 2 IF DIA<1 OR DIA>29 DISPLAY "DIA INVALIDO"
            WHEN 3 IF DIA<1 OR DIA>31 DISPLAY "DIA INVALIDO"
            WHEN 4 IF DIA<1 OR DIA>30 DISPLAY "DIA INVALIDO"
            WHEN 5 IF DIA<1 OR DIA>31 DISPLAY "DIA INVALIDO"
            WHEN 6 IF DIA<1 OR DIA>30 DISPLAY "DIA INVALIDO"
            WHEN 7 IF DIA<1 OR DIA>31 DISPLAY "DIA INVALIDO"
            WHEN 8 IF DIA<1 OR DIA>31 DISPLAY "DIA INVALIDO"
            WHEN 9 IF DIA<1 OR DIA>30 DISPLAY "DIA INVALIDO"
            WHEN 10 IF DIA<1 OR DIA>31 DISPLAY "DIA INVALIDO"
            WHEN 11 IF DIA<1 OR DIA>30 DISPLAY "DIA INVALIDO"
            WHEN 12 IF DIA<1 OR DIA>31 DISPLAY "DIA INVALIDO"
            WHEN OTHER DISPLAY "MES INVALIDO"
            END-EVALUATE.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
