       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 NUM PIC 999 VALUE 1.
       77 PRIMO PIC 999.
       77 R2 PIC 9.
       77 R3 PIC 9.
       77 R5 PIC 9.
       77 R7 PIC 9.
       77 R11 PIC 99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM UNTIL NUM=0
           DISPLAY "INSIRA UM NUMERO " ACCEPT NUM
           DIVIDE NUM BY 2 GIVING PRIMO REMAINDER R2
           DIVIDE NUM BY 3 GIVING PRIMO REMAINDER R3
           DIVIDE NUM BY 5 GIVING PRIMO REMAINDER R5
           DIVIDE NUM BY 7 GIVING PRIMO REMAINDER R7
           DIVIDE NUM BY 11 GIVING PRIMO REMAINDER R11
           IF NUM=0
             GOBACK
           ELSE IF R2=0 OR R3=0 OR R5=5 OR R7=0 OR R11=0
             DISPLAY "É MULTIPLO DOS PRIMEIROS 5 NUMEROS PRIMOS"
           ELSE
             DISPLAY "NAO É MULTIPLO DOS PRIMEIROS 5 NUMEROS PRIMOS"
           END-PERFORM
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
