       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 GRAUS PIC 999V99.
       77 OP PIC 9.
       77 RES PIC 999V99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "INSIRA OS GRAUS : " ACCEPT GRAUS
            DISPLAY "DESEJA CÉLSIUS (1), OU FAHRENHEIT (2), SAIR (3)"
            ACCEPT OP
            EVALUATE OP
            WHEN 1 COMPUTE RES=GRAUS/1.8- 32
            WHEN 2 COMPUTE RES=GRAUS*1.8+ 32
            WHEN 3 GOBACK
            WHEN OTHER DISPLAY "INSIRA UMA OPÇAO VÁLIDA"
            END-EVALUATE.
            DISPLAY "SAO " RES " GRAUS"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
