       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 NUM1 PIC 999.
       77 NUM2 PIC 999.
       77 NUM3 PIC 999.
       77 AB PIC 99.
       77 AC PIC 99.
       77 CB PIC 99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INSIRA 3 NUMEROS : "
            DISPLAY "1º NUMERO : " ACCEPT NUM1
            DISPLAY "2º NUMERO : " ACCEPT NUM2
            DISPLAY "3º NUMERO : " ACCEPT NUM3
           COMPUTE AB=NUM1+NUM2
           COMPUTE AC=NUM1+NUM3
           COMPUTE CB=NUM2+NUM3
           IF NUM1 NOT=0 AND NUM2 NOT=0 AND NUM3 NOT=0 AND NUM3<CB
           IF NUM2<AC AND NUM1<CB
               DISPLAY "OS LADOS PODEM SER UM TRIANGULO"
           ELSE
               DISPLAY "OS LADOS NAO PODEM SER UM TRIANGULO"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
