       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 SALARIO PIC 9999V99.
       77 IRS PIC 999V99.
       77 SS PIC 999V99.
       77 LIQUIDO PIC 9999V99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INSIRA O SEU SALARIO BRUTO" ACCEPT SALARIO
            COMPUTE IRS=SALARIO * 0.15
            COMPUTE SS=SALARIO * 0.12
            COMPUTE LIQUIDO=(SS+IRS)-SALARIO
            DISPLAY "O SEU SALARIO BRUTO É : " SALARIO
            DISPLAY "O VALOR DESCONTADO COM A SEGURANÇA SOCIAL É : " SS
            DISPLAY "O VALOR DESCONTADO COM O IRS É : " IRS
            DISPLAY "O SEU SALARIO LIQUIDO É : " LIQUIDO
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
