       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 L PIC 99 VALUE 0.
       77 A PIC 999 VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Introduza largura de um lado do quadrado " ACCEPT L
            MULTIPLY L BY L GIVING A
            DISPLAY "A AREA DO QUADRADO É " A
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
