       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 SOMA PIC 9999 VALUE 0.
       77 NUMPAR PIC 999 VALUE 100.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM UNTIL NUMPAR>=200
           COMPUTE NUMPAR = NUMPAR + 2
           DISPLAY NUMPAR
           COMPUTE SOMA = SOMA + NUMPAR
           END-PERFORM.
           DISPLAY "O RESULTADO É " SOMA
           STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
